Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/pmu.h
/*
 * Component description for PMU
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_PMU_COMPONENT_H_
#define _PIC32WM_BZ6_PMU_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PMU                       */
/* ************************************************************************** */

/* -------- PMU_SPICTRL : (PMU Offset: 0x00) (R/W 32)  -------- */
#define PMU_SPICTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_SPICTRL)   Reset Value */

#define PMU_SPICTRL_SPIWDATA_Pos              _UINT32_(0)                                          /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIWDATA_Msk              (_UINT32_(0xFFFF) << PMU_SPICTRL_SPIWDATA_Pos)       /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIWDATA(value)           (PMU_SPICTRL_SPIWDATA_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIWDATA_Pos)) /* Assignment of value for SPIWDATA in the PMU_SPICTRL register */
#define PMU_SPICTRL_SPIADDR_Pos               _UINT32_(16)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIADDR_Msk               (_UINT32_(0xFF) << PMU_SPICTRL_SPIADDR_Pos)          /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIADDR(value)            (PMU_SPICTRL_SPIADDR_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIADDR_Pos)) /* Assignment of value for SPIADDR in the PMU_SPICTRL register */
#define PMU_SPICTRL_CMD_Pos                   _UINT32_(24)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_CMD_Msk                   (_UINT32_(0x1) << PMU_SPICTRL_CMD_Pos)               /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_CMD(value)                (PMU_SPICTRL_CMD_Msk & (_UINT32_(value) << PMU_SPICTRL_CMD_Pos)) /* Assignment of value for CMD in the PMU_SPICTRL register */
#define PMU_SPICTRL_PMUCRST_Pos               _UINT32_(30)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_PMUCRST_Msk               (_UINT32_(0x1) << PMU_SPICTRL_PMUCRST_Pos)           /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_PMUCRST(value)            (PMU_SPICTRL_PMUCRST_Msk & (_UINT32_(value) << PMU_SPICTRL_PMUCRST_Pos)) /* Assignment of value for PMUCRST in the PMU_SPICTRL register */
#define PMU_SPICTRL_SPIRST_Pos                _UINT32_(31)                                         /* (PMU_SPICTRL)  Position */
#define PMU_SPICTRL_SPIRST_Msk                (_UINT32_(0x1) << PMU_SPICTRL_SPIRST_Pos)            /* (PMU_SPICTRL)  Mask */
#define PMU_SPICTRL_SPIRST(value)             (PMU_SPICTRL_SPIRST_Msk & (_UINT32_(value) << PMU_SPICTRL_SPIRST_Pos)) /* Assignment of value for SPIRST in the PMU_SPICTRL register */
#define PMU_SPICTRL_Msk                       _UINT32_(0xC1FFFFFF)                                 /* (PMU_SPICTRL) Register Mask  */


/* -------- PMU_SPISTATUS : (PMU Offset: 0x04) (R/W 32)  -------- */
#define PMU_SPISTATUS_RESETVALUE              _UINT32_(0x08)                                       /*  (PMU_SPISTATUS)   Reset Value */

#define PMU_SPISTATUS_SPIERR_Pos              _UINT32_(0)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIERR_Msk              (_UINT32_(0x1) << PMU_SPISTATUS_SPIERR_Pos)          /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIERR(value)           (PMU_SPISTATUS_SPIERR_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIERR_Pos)) /* Assignment of value for SPIERR in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIRDY_Pos              _UINT32_(7)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDY_Msk              (_UINT32_(0x1) << PMU_SPISTATUS_SPIRDY_Pos)          /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDY(value)           (PMU_SPISTATUS_SPIRDY_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIRDY_Pos)) /* Assignment of value for SPIRDY in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIADDR_Pos             _UINT32_(8)                                          /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIADDR_Msk             (_UINT32_(0xFF) << PMU_SPISTATUS_SPIADDR_Pos)        /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIADDR(value)          (PMU_SPISTATUS_SPIADDR_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIADDR_Pos)) /* Assignment of value for SPIADDR in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_SPIRDATA_Pos            _UINT32_(16)                                         /* (PMU_SPISTATUS)  Position */
#define PMU_SPISTATUS_SPIRDATA_Msk            (_UINT32_(0xFFFF) << PMU_SPISTATUS_SPIRDATA_Pos)     /* (PMU_SPISTATUS)  Mask */
#define PMU_SPISTATUS_SPIRDATA(value)         (PMU_SPISTATUS_SPIRDATA_Msk & (_UINT32_(value) << PMU_SPISTATUS_SPIRDATA_Pos)) /* Assignment of value for SPIRDATA in the PMU_SPISTATUS register */
#define PMU_SPISTATUS_Msk                     _UINT32_(0xFFFFFF81)                                 /* (PMU_SPISTATUS) Register Mask  */


/* -------- PMU_CLKCTRL : (PMU Offset: 0x08) (R/W 32)  -------- */
#define PMU_CLKCTRL_RESETVALUE                _UINT32_(0x5082)                                     /*  (PMU_CLKCTRL)   Reset Value */

#define PMU_CLKCTRL_SPICLKDIV_Pos             _UINT32_(0)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPICLKDIV_Msk             (_UINT32_(0x3F) << PMU_CLKCTRL_SPICLKDIV_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPICLKDIV(value)          (PMU_CLKCTRL_SPICLKDIV_Msk & (_UINT32_(value) << PMU_CLKCTRL_SPICLKDIV_Pos)) /* Assignment of value for SPICLKDIV in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_PMUANA_BKBOREN_Pos        _UINT32_(6)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_PMUANA_BKBOREN_Msk        (_UINT32_(0x1) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos)    /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_PMUANA_BKBOREN(value)     (PMU_CLKCTRL_PMUANA_BKBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_PMUANA_BKBOREN_Pos)) /* Assignment of value for PMUANA_BKBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_SPISRC_Pos                _UINT32_(7)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_SPISRC_Msk                (_UINT32_(0x1) << PMU_CLKCTRL_SPISRC_Pos)            /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_SPISRC(value)             (PMU_CLKCTRL_SPISRC_Msk & (_UINT32_(value) << PMU_CLKCTRL_SPISRC_Pos)) /* Assignment of value for SPISRC in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKCLKDIV_Pos            _UINT32_(8)                                          /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKCLKDIV_Msk            (_UINT32_(0x3F) << PMU_CLKCTRL_BUCKCLKDIV_Pos)       /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKCLKDIV(value)         (PMU_CLKCTRL_BUCKCLKDIV_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKCLKDIV_Pos)) /* Assignment of value for BUCKCLKDIV in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKSRC_Pos               _UINT32_(14)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKSRC_Msk               (_UINT32_(0x3) << PMU_CLKCTRL_BUCKSRC_Pos)           /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKSRC(value)            (PMU_CLKCTRL_BUCKSRC_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKSRC_Pos)) /* Assignment of value for BUCKSRC in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BACWD_Pos                 _UINT32_(16)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BACWD_Msk                 (_UINT32_(0x1) << PMU_CLKCTRL_BACWD_Pos)             /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BACWD(value)              (PMU_CLKCTRL_BACWD_Msk & (_UINT32_(value) << PMU_CLKCTRL_BACWD_Pos)) /* Assignment of value for BACWD in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MLDOEXTEN_Pos             _UINT32_(17)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXTEN_Msk             (_UINT32_(0x1) << PMU_CLKCTRL_MLDOEXTEN_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXTEN(value)          (PMU_CLKCTRL_MLDOEXTEN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MLDOEXTEN_Pos)) /* Assignment of value for MLDOEXTEN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MVREFFSMEN_Pos            _UINT32_(18)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MVREFFSMEN_Msk            (_UINT32_(0x1) << PMU_CLKCTRL_MVREFFSMEN_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MVREFFSMEN(value)         (PMU_CLKCTRL_MVREFFSMEN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MVREFFSMEN_Pos)) /* Assignment of value for MVREFFSMEN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_CMP_CYCLE_Pos             _UINT32_(20)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_CMP_CYCLE_Msk             (_UINT32_(0xF) << PMU_CLKCTRL_CMP_CYCLE_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_CMP_CYCLE(value)          (PMU_CLKCTRL_CMP_CYCLE_Msk & (_UINT32_(value) << PMU_CLKCTRL_CMP_CYCLE_Pos)) /* Assignment of value for CMP_CYCLE in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BKCLK_HW_OVR_Pos          _UINT32_(24)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BKCLK_HW_OVR_Msk          (_UINT32_(0x1) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos)      /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BKCLK_HW_OVR(value)       (PMU_CLKCTRL_BKCLK_HW_OVR_Msk & (_UINT32_(value) << PMU_CLKCTRL_BKCLK_HW_OVR_Pos)) /* Assignment of value for BKCLK_HW_OVR in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_MLDOEXT_BOREN_Pos         _UINT32_(26)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_MLDOEXT_BOREN_Msk         (_UINT32_(0x1) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos)     /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_MLDOEXT_BOREN(value)      (PMU_CLKCTRL_MLDOEXT_BOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_MLDOEXT_BOREN_Pos)) /* Assignment of value for MLDOEXT_BOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_ADCBOREN_Pos              _UINT32_(27)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_ADCBOREN_Msk              (_UINT32_(0x1) << PMU_CLKCTRL_ADCBOREN_Pos)          /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_ADCBOREN(value)           (PMU_CLKCTRL_ADCBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_ADCBOREN_Pos)) /* Assignment of value for ADCBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_BUCKBOREN_Pos             _UINT32_(28)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_BUCKBOREN_Msk             (_UINT32_(0x1) << PMU_CLKCTRL_BUCKBOREN_Pos)         /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_BUCKBOREN(value)          (PMU_CLKCTRL_BUCKBOREN_Msk & (_UINT32_(value) << PMU_CLKCTRL_BUCKBOREN_Pos)) /* Assignment of value for BUCKBOREN in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_F_BCLK_CFG_Pos            _UINT32_(29)                                         /* (PMU_CLKCTRL)  Position */
#define PMU_CLKCTRL_F_BCLK_CFG_Msk            (_UINT32_(0x1) << PMU_CLKCTRL_F_BCLK_CFG_Pos)        /* (PMU_CLKCTRL)  Mask */
#define PMU_CLKCTRL_F_BCLK_CFG(value)         (PMU_CLKCTRL_F_BCLK_CFG_Msk & (_UINT32_(value) << PMU_CLKCTRL_F_BCLK_CFG_Pos)) /* Assignment of value for F_BCLK_CFG in the PMU_CLKCTRL register */
#define PMU_CLKCTRL_Msk                       _UINT32_(0x3DF7FFFF)                                 /* (PMU_CLKCTRL) Register Mask  */


/* -------- PMU_MODECTRL1 : (PMU Offset: 0x0C) (R/W 32)  -------- */
#define PMU_MODECTRL1_RESETVALUE              _UINT32_(0x80000000)                                 /*  (PMU_MODECTRL1)   Reset Value */

#define PMU_MODECTRL1_VREG4CTRL_Pos           _UINT32_(0)                                          /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG4CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG4CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG4CTRL(value)        (PMU_MODECTRL1_VREG4CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG4CTRL_Pos)) /* Assignment of value for VREG4CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG3CTRL_Pos           _UINT32_(8)                                          /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG3CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG3CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG3CTRL(value)        (PMU_MODECTRL1_VREG3CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG3CTRL_Pos)) /* Assignment of value for VREG3CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG2CTRL_Pos           _UINT32_(16)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG2CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG2CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG2CTRL(value)        (PMU_MODECTRL1_VREG2CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG2CTRL_Pos)) /* Assignment of value for VREG2CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_VREG1CTRL_Pos           _UINT32_(24)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_VREG1CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL1_VREG1CTRL_Pos)      /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_VREG1CTRL(value)        (PMU_MODECTRL1_VREG1CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL1_VREG1CTRL_Pos)) /* Assignment of value for VREG1CTRL in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_BUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKMODE_Msk            (_UINT32_(0x1) << PMU_MODECTRL1_BUCKMODE_Pos)        /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKMODE(value)         (PMU_MODECTRL1_BUCKMODE_Msk & (_UINT32_(value) << PMU_MODECTRL1_BUCKMODE_Pos)) /* Assignment of value for BUCKMODE in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_MLDOEN_Pos              _UINT32_(30)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_MLDOEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL1_MLDOEN_Pos)          /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_MLDOEN(value)           (PMU_MODECTRL1_MLDOEN_Msk & (_UINT32_(value) << PMU_MODECTRL1_MLDOEN_Pos)) /* Assignment of value for MLDOEN in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_BUCKEN_Pos              _UINT32_(31)                                         /* (PMU_MODECTRL1)  Position */
#define PMU_MODECTRL1_BUCKEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL1_BUCKEN_Pos)          /* (PMU_MODECTRL1)  Mask */
#define PMU_MODECTRL1_BUCKEN(value)           (PMU_MODECTRL1_BUCKEN_Msk & (_UINT32_(value) << PMU_MODECTRL1_BUCKEN_Pos)) /* Assignment of value for BUCKEN in the PMU_MODECTRL1 register */
#define PMU_MODECTRL1_Msk                     _UINT32_(0xFF1F1F1F)                                 /* (PMU_MODECTRL1) Register Mask  */


